MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC140LD2CN/mcu.h
 * |        |          |Note2: When operating in Smart Card mode, user must set UA_MODE_EN(SC_UACTL [0]) = 00.
 * |        |          |Note3: When UART is enabled, hardware will generate a reset to reset FIFO and internal state
 * |        |          |machine.
 * |[5:4]   |DATA_LEN10|Data Length
 * |        |          |00 = Character Data Length is 8 bits.
 * |        |          |01 = Character Data Length is 7 bits.
 * |        |          |10 = Character Data length is 6 bits.
 * |        |          |11 = Character Data Length is 5 bits.
 * |        |          |Note: In smart card mode, this DATA_LEN must be '00'
 * |[6]     |PBDIS     |Parity Bit Disable Control
 * |        |          |0 = Parity bit is generated or checked between the "last data word bit" and "stop bit" of the
 * |        |          |serial data.
 * |        |          |1 = Parity bit is not generated (transmitting data) or checked (receiving data) during transfer.
 * |        |          |Note: In smart card mode, this field must be '0' (default setting is with parity bit)
 * |[7]     |OPE       |Odd Parity Enable Control
 * |        |          |0 = Even number of logic 1's are transmitted or check the data word and parity bits in receiving
 * |        |          |mode.
 * |        |          |1 = Odd number of logic 1's are transmitted or check the data word and parity bits in receiving
 * |        |          |mode.
 * |        |          |Note: This bit has effect only when PBDIS bit is '0'.
 * @var SC_T::TDRA
 * Offset: 0x38  SC Timer Current Data Register A
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |TDR0      |Timer0 Current Data value(Read Only)
 * |        |          |This field indicates the current count values of timer0.
 * @var SC_T::TDRB
 * Offset: 0x3C  SC Timer Current Data Register B
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TDR1      |Timer1 Current Data value(Read Only)
 * |        |          |This field indicates the current count values of timer1.
 * |[15:8]  |TDR2      |Timer2 Current Data value (Read Only)
 * |        |          |This field indicates the current count values of timer2.
 */

    union {
    __I  uint32_t RBR;           /* Offset: 0x00  SC Receiving Buffer Register.                                      */
    __O  uint32_t THR;           /* Offset: 0x00  SC Transmit Holding Register                                       */
    };
    __IO uint32_t CTL;           /* Offset: 0x04  SC Control Register                                                */
    __IO uint32_t ALTCTL;        /* Offset: 0x08  SC Alternate Control Register                                      */
    __IO uint32_t EGTR;          /* Offset: 0x0C  SC Extend Guard Time Register                                      */
    __IO uint32_t RFTMR;         /* Offset: 0x10  SC Receive buffer Time-out Register                                */
    __IO uint32_t ETUCR;         /* Offset: 0x14  SC ETU Control Register                                            */
    __IO uint32_t IER;           /* Offset: 0x18  SC Interrupt Enable Control Register                               */
    __IO uint32_t ISR;           /* Offset: 0x1C  SC Interrupt Status Register                                       */
    __IO uint32_t TRSR;          /* Offset: 0x20  SC Status Register                                                 */
    __IO uint32_t PINCSR;        /* Offset: 0x24  SC Pin Control State Register                                      */
    __IO uint32_t TMR0;          /* Offset: 0x28  SC Internal Timer Control Register 0                               */
    __IO uint32_t TMR1;          /* Offset: 0x2C  SC Internal Timer Control Register 1                               */
    __IO uint32_t TMR2;          /* Offset: 0x30  SC Internal Timer Control Register 2                               */
    __IO uint32_t UACTL;         /* Offset: 0x34  SC UART Mode Control Register.                                     */
    __I  uint32_t TDRA;          /* Offset: 0x38  SC Timer Current Data Register A                                   */
    __I  uint32_t TDRB;          /* Offset: 0x3C  SC Timer Current Data Register B                                   */

} SC_T;


/**
    @addtogroup SC_CONST SC Bit Field Definition
    Constant Definitions for SC Controller
@{ */


/* SC RBR Bit Field Definitions */
#define SC_RBR_RBR_Pos                      0                                /*!< SC_T::RBR: RBR Position */
#define SC_RBR_RBR_Msk                      (0xFFul << SC_RBR_RBR_Pos)       /*!< SC_T::RBR: RBR Mask */

/* SC THR Bit Field Definitions */
#define SC_THR_THR_Pos                      0                                /*!< SC_T::THR: THR Position */
#define SC_THR_THR_Msk                      (0xFFul << SC_THR_THR_Pos)       /*!< SC_T::THR: THR Mask */

/* SC CTL Bit Field Definitions */
#define SC_CTL_SYNC_Pos                     30                               /*!< SC_T::CTL: SYNC Position */
#define SC_CTL_SYNC_Msk                     (1ul << SC_CTL_SYNC_Pos)   /*!< SC_T::CTL: SYNC Mask */

#define SC_CTL_CD_DEB_SEL_Pos               24                               /*!< SC_T::CTL: CD_DEB_SEL Position */
#define SC_CTL_CD_DEB_SEL_Msk               (3ul << SC_CTL_CD_DEB_SEL_Pos)   /*!< SC_T::CTL: CD_DEB_SEL Mask */

#define SC_CTL_TX_ERETRY_EN_Pos             23                               /*!< SC_T::CTL: TX_ERETRY_EN Position */
#define SC_CTL_TX_ERETRY_EN_Msk             (1ul << SC_CTL_TX_ERETRY_EN_Pos) /*!< SC_T::CTL: TX_ERETRY_EN Mask */

#define SC_CTL_TX_ERETRY_Pos                20                               /*!< SC_T::CTL: TX_ERETRY Position */
#define SC_CTL_TX_ERETRY_Msk                (7ul << SC_CTL_TX_ERETRY_Pos)    /*!< SC_T::CTL: TX_ERETRY Mask */

#define SC_CTL_RX_ERETRY_EN_Pos             19                               /*!< SC_T::CTL: RX_ERETRY_EN Position */
#define SC_CTL_RX_ERETRY_EN_Msk             (1ul << SC_CTL_RX_ERETRY_EN_Pos) /*!< SC_T::CTL: RX_ERETRY_EN Mask */

#define SC_CTL_RX_ERETRY_Pos                16                               /*!< SC_T::CTL: RX_ERETRY Position */
#define SC_CTL_RX_ERETRY_Msk                (7ul << SC_CTL_RX_ERETRY_Pos)    /*!< SC_T::CTL: RX_ERETRY Mask */

#define SC_CTL_SLEN_Pos                     15                               /*!< SC_T::CTL: SLEN Position */
#define SC_CTL_SLEN_Msk                     (1ul << SC_CTL_SLEN_Pos)         /*!< SC_T::CTL: SLEN Mask */

#define SC_CTL_TMR_SEL_Pos                  13                               /*!< SC_T::CTL: TMR_SEL Position */
#define SC_CTL_TMR_SEL_Msk                  (3ul << SC_CTL_TMR_SEL_Pos)      /*!< SC_T::CTL: TMR_SEL Mask */

#define SC_CTL_BGT_Pos                      8                                /*!< SC_T::CTL: BGT Position */
#define SC_CTL_BGT_Msk                      (0x1Ful << SC_CTL_BGT_Pos)       /*!< SC_T::CTL: BGT Mask */

